lkolbly/cmsis-svd/data/TexasInstruments/LM3S2410.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN0</name>
      <description>Register map for CAN0 peripheral</description>
      <groupName>CAN</groupName>
      <prependToName>CAN0</prependToName>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>CAN Control</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>CAN_CTL_INIT</name>
              <description>Initialization</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CAN_CTL_IE</name>
              <description>CAN Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAN_CTL_SIE</name>
              <description>Status Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CAN_CTL_EIE</name>
              <description>Error Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CAN_CTL_DAR</name>
              <description>Disable Automatic-Retransmission</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CAN_CTL_CCE</name>
              <description>Configuration Change Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CAN_CTL_TEST</name>
              <description>Test Mode Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STS</name>
          <description>CAN Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>CAN_STS_LEC</name>
              <description>Last Error Code</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_STS_LEC_NONE</name>
                  <description>No Error</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_STUFF</name>
                  <description>Stuff Error</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_FORM</name>
                  <description>Format Error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_ACK</name>
                  <description>ACK Error</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_BIT1</name>
                  <description>Bit 1 Error</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_BIT0</name>
                  <description>Bit 0 Error</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_CRC</name>
                  <description>CRC Error</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_STS_LEC_NOEVENT</name>
                  <description>No Event</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_STS_TXOK</name>
              <description>Transmitted a Message Successfully</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CAN_STS_RXOK</name>
              <description>Received a Message Successfully</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CAN_STS_EPASS</name>
              <description>Error Passive</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CAN_STS_EWARN</name>
              <description>Warning Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CAN_STS_BOFF</name>
              <description>Bus-Off Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR</name>
          <description>CAN Error Counter</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>CAN_ERR_TEC</name>
              <description>Transmit Error Counter</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>CAN_ERR_REC</name>
              <description>Receive Error Counter</description>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>CAN_ERR_RP</name>
              <description>Received Error Passive</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BIT</name>
          <description>CAN Bit Timing</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>CAN_BIT_BRP</name>
              <description>Baud Rate Prescaler</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>CAN_BIT_SJW</name>
              <description>(Re)Synchronization Jump Width</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>CAN_BIT_TSEG1</name>
              <description>Time Segment Before Sample Point</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>CAN_BIT_TSEG2</name>
              <description>Time Segment after Sample Point</description>
              <bitRange>[14:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INT</name>
          <description>CAN Interrupt</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>CAN_INT_INTID</name>
              <description>Interrupt Identifier</description>
              <bitRange>[15:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_INT_INTID_NONE</name>
                  <description>No interrupt pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_INT_INTID_STATUS</name>
                  <description>Status Interrupt</description>
                  <value>0x8000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TST</name>
          <description>CAN Test</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>CAN_TST_BASIC</name>
              <description>Basic Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CAN_TST_SILENT</name>
              <description>Silent Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CAN_TST_LBACK</name>
              <description>Loopback Mode</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CAN_TST_TX</name>
              <description>Transmit Control</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_TST_TX_CANCTL</name>
                  <description>CAN Module Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TST_TX_SAMPLE</name>
                  <description>Sample Point</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TST_TX_DOMINANT</name>
                  <description>Driven Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAN_TST_TX_RECESSIVE</name>
                  <description>Driven High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_TST_RX</name>
              <description>Receive Observation</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRPE</name>
          <description>CAN Baud Rate Prescaler Extension</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>CAN_BRPE_BRPE</name>
              <description>Baud Rate Prescaler Extension</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1CRQ</name>
          <description>CAN IF1 Command Request</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1CRQ_MNUM</name>
              <description>Message Number</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_IF1CRQ_MNUM_RSVD</name>
                  <description>0 is not a valid message number; it is interpreted as 0x20, or object 32</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_IF1CRQ_BUSY</name>
              <description>Busy Flag</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1CMSK</name>
          <description>CAN IF1 Command Mask</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1CMSK_DATAB</name>
              <description>Access Data Byte 4 to 7</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_DATAA</name>
              <description>Access Data Byte 0 to 3</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_NEWDAT</name>
              <description>Access New Data</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_CLRINTPND</name>
              <description>Clear Interrupt Pending Bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_CONTROL</name>
              <description>Access Control Bits</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_ARB</name>
              <description>Access Arbitration Bits</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_MASK</name>
              <description>Access Mask Bits</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CAN_IF1CMSK_WRNRD</name>
              <description>Write, Not Read</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1CMSK</name>
          <description>CAN IF1 Command Mask</description>
          <alternateGroup>CAN0_ALT</alternateGroup>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1CMSK_TXRQST</name>
              <description>Access Transmission Request</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1MSK1</name>
          <description>CAN IF1 Mask 1</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1MSK1_IDMSK</name>
              <description>Identifier Mask</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1MSK2</name>
          <description>CAN IF1 Mask 2</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1MSK2_IDMSK</name>
              <description>Identifier Mask</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MSK2_MDIR</name>
              <description>Mask Message Direction</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MSK2_MXTD</name>
              <description>Mask Extended Identifier</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1ARB1</name>
          <description>CAN IF1 Arbitration 1</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1ARB1_ID</name>
              <description>Message Identifier</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1ARB2</name>
          <description>CAN IF1 Arbitration 2</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1ARB2_ID</name>
              <description>Message Identifier</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF1ARB2_DIR</name>
              <description>Message Direction</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CAN_IF1ARB2_XTD</name>
              <description>Extended Identifier</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAN_IF1ARB2_MSGVAL</name>
              <description>Message Valid</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1MCTL</name>
          <description>CAN IF1 Message Control</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1MCTL_DLC</name>
              <description>Data Length Code</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_EOB</name>
              <description>End of Buffer</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_TXRQST</name>
              <description>Transmit Request</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_RMTEN</name>
              <description>Remote Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_RXIE</name>
              <description>Receive Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_UMASK</name>
              <description>Use Acceptance Mask</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_INTPND</name>
              <description>Interrupt Pending</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_MSGLST</name>
              <description>Message Lost</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAN_IF1MCTL_NEWDAT</name>
              <description>New Data</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DA1</name>
          <description>CAN IF1 Data A1</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1DA1_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DA2</name>
          <description>CAN IF1 Data A2</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1DA2_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DB1</name>
          <description>CAN IF1 Data B1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1DB1_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF1DB2</name>
          <description>CAN IF1 Data B2</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>CAN_IF1DB2_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2CRQ</name>
          <description>CAN IF2 Command Request</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2CRQ_MNUM</name>
              <description>Message Number</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAN_IF2CRQ_MNUM_RSVD</name>
                  <description>0 is not a valid message number; it is interpreted as 0x20, or object 32</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_IF2CRQ_BUSY</name>
              <description>Busy Flag</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2CMSK</name>
          <description>CAN IF2 Command Mask</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2CMSK_DATAB</name>
              <description>Access Data Byte 4 to 7</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_DATAA</name>
              <description>Access Data Byte 0 to 3</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_NEWDAT</name>
              <description>Access New Data</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_CLRINTPND</name>
              <description>Clear Interrupt Pending Bit</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_CONTROL</name>
              <description>Access Control Bits</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_ARB</name>
              <description>Access Arbitration Bits</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_MASK</name>
              <description>Access Mask Bits</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CAN_IF2CMSK_WRNRD</name>
              <description>Write, Not Read</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2CMSK</name>
          <description>CAN IF2 Command Mask</description>
          <alternateGroup>CAN0_ALT</alternateGroup>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2CMSK_TXRQST</name>
              <description>Access Transmission Request</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2MSK1</name>
          <description>CAN IF2 Mask 1</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2MSK1_IDMSK</name>
              <description>Identifier Mask</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2MSK2</name>
          <description>CAN IF2 Mask 2</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2MSK2_IDMSK</name>
              <description>Identifier Mask</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MSK2_MDIR</name>
              <description>Mask Message Direction</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MSK2_MXTD</name>
              <description>Mask Extended Identifier</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
